'use server';

import Image from 'next/image';
import Link from 'next/link';

import Attention from './Attention';
import BlogHeading from './BlogHeading';

import sampleImage from '@/public/sample-blog-image.jpg';
import download from '@/icons/download.svg';
import { Code } from 'bright';
import SimilarArticles from './SimilarArticles';
import BlogCommentsButton from './BlogCommentsButton';
import { parseOptions } from '@/utility/html-react-parser';

import parse, {
  domToReact,
  HTMLReactParserOptions,
  DOMNode,
  Element,
  Text,
} from 'html-react-parser';
// import { parseHTML } from 'linkedom';

function BlogPostContent({ content }: { content: string }) {
  const parsedHTML = parse(content, parseOptions);

  // console.log(
  //   '------------------------------------------- START --------------'
  // );
  // console.dir(newParsed, { depth: 4 });
  // console.log('------------------------------------------- END --------------');

  return (
    <div
      className="mx-auto max-w-[95%] text-justify leading-[3]  2xl:text-lg 2xl:leading-10"
      // dangerouslySetInnerHTML={{ __html:  }}
    >
      {parsedHTML}
      {/* {<Image src="/link.svg" width={100} height={100} alt="asdasd" />} */}
      {/* {blogHeading('hello', 'id', 'as')} */}
    </div>
  );

  // return (
  //   <div className="mx-auto my-20 max-w-[95%] text-justify leading-[3]  2xl:text-lg 2xl:leading-10">
  //     <BlogHeading href="#installation" id="installation">
  //       ۱. نصب ابزار های مورد نیاز
  //     </BlogHeading>

  //     <p>
  //       لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده
  //       از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و
  //       سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای
  //       متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه
  //       درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با
  //       نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان
  //       خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید
  //       داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان
  //       رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات
  //       پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.لورم ایپسوم
  //       متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان
  //       گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که
  //       لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف
  //       بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته حال
  //       و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها
  //       شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ
  //       پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و
  //       دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان
  //       مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل
  //       دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.لورم ایپسوم متن ساختگی با
  //       تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است،
  //       چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و
  //       برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود
  //       ابزارهای کاربردی می باشد.
  //     </p>

  //     <Attention type="ALERT">
  //       لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده
  //       از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و
  //       سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای
  //       متنوع با هدف بهبود ابزارهای کاربردی می باشد.
  //     </Attention>

  //     <BlogHeading href="#design" id="design">
  //       ۲. طراحی UI
  //     </BlogHeading>

  //     <p>
  //       لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده
  //       از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و
  //       سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای
  //       متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه
  //       درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با
  //       نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان
  //       خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید
  //       داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان
  //       رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات
  //       پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.
  //     </p>

  //     <Attention type="NOTE">
  //       لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده
  //       از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و
  //       سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای
  //       متنوع با هدف بهبود ابزارهای کاربردی می باشد.
  //     </Attention>

  //     <p>
  //       لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده
  //       از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و
  //       سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای
  //       متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه
  //       درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با
  //       نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان
  //       خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید
  //       داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان
  //       رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات
  //       پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.
  //     </p>

  //     <div className="ltr mx-auto lg:max-w-[90%]">
  //       <Code lang="tsx" theme={'one-dark-pro'}>
  //         {myCode}
  //       </Code>
  //     </div>

  //     <p>
  //       لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده
  //       از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و
  //       سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای
  //       متنوع با هدف بهبود ابزارهای کاربردی می باشد.
  //     </p>

  //     <div className="my-10 text-center">
  //       <Image
  //         src={sampleImage}
  //         alt=""
  //         className="mx-auto max-w-full rounded-xl lg:max-w-[1000px]"
  //       />
  //       <span className="text-sm text-slate-400 lg:text-base">
  //         نمونه ی توضیح تصاویر شماره ۱
  //       </span>
  //     </div>

  //     <p>
  //       لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده
  //       از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و
  //       سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای
  //       متنوع با هدف بهبود ابزارهای کاربردی می باشد.
  //     </p>

  //     <div className="mb-32 mt-10">
  //       <div className="my-10 text-center">
  //         <Link href={'#'} className="w-10 rounded-xl bg-[#FE634E] px-12 py-4">
  //           <Image
  //             width={25}
  //             src={download}
  //             alt="download article"
  //             className="inline-block align-text-bottom"
  //           />
  //           <span className="pr-2 font-bold text-white"> PDF </span>
  //         </Link>
  //       </div>

  //       <BlogCommentsButton />
  //     </div>

  //     <div className="">
  //       <p className="text-2xl font-bold text-slate-400">
  //         شاید از این مقالات نیز خوشتان بیاید:
  //       </p>

  //       <SimilarArticles />
  //     </div>
  //   </div>
  // );
}

export default BlogPostContent;
